# PathMeasurementType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DefaultDivideSettings..::..PathMeasurementType Property
DefaultDivideSettings Class See Also
---
A default Divided Path measurement type for distance layouts.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public DividedPathMeasurementType PathMeasurementType { get; set; }
```

Visual Basic
---
```text
Public Property PathMeasurementType As DividedPathMeasurementType
	Get
	Set
```

Visual C++
---
```text
public:
property DividedPathMeasurementType PathMeasurementType {
	DividedPathMeasurementType get ();
	void set (DividedPathMeasurementType value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
DefaultDivideSettings Class
Autodesk.Revit.DB Namespace